package com.example.m12_mvvm.textStorage

import com.example.m12_mvvm.R

class News {
    val textsLogo = listOf(
        "IGM", "SWAT", "4ch", "WORLD", "Прочто-то", "Marvel", "NEWS", "Minecraft"
    )
    val textsContainer = listOf(
        "Случайный текст - Равным образом, реализация намеченных плановых заданий позволяет" +
                " оценить значение форм воздействия." +
                " С учётом сложившейся международной обстановки, разбавленное изрядной долей эмпатии, " +
                "рациональное мышление требует определения и уточнения глубокомысленных рассуждений",
        " В своём стремлении улучшить пользовательский опыт мы упускаем, что многие известные" +
                " личности являются только методом политического участия и заблокированы в " +
                "рамках своих собственных рациональных ограничений.",
        " Также как консультация с широким активом создаёт предпосылки для прогресса " +
                "профессионального сообщества."
    )
    val imageLogo = listOf(R.drawable.logo)
    val imageContainer = listOf(
        R.drawable.news,
        R.drawable.news2,
        R.drawable.kospley,
        R.drawable.hogvarts_legacy,
        R.drawable.mem
    )
}